cxfProxyService/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mod="http://redhat.com//model">
   <soapenv:Header/>
   <soapenv:Body>
      <mod:sayHi>
         <mod:requestType>Viral</mod:requestType>
      </mod:sayHi>
   </soapenv:Body>
</soapenv:Envelope>